app/Controllers/Gold.php

    public function index()
    {
        $user_id = session()->get('user_id') ? session()->get('user_id') : 1;
        $userModel = new UserModel();
        $user = $userModel->find($user_id);
        $is_gold = $user['is_gold'];

        $prix_gold = new PrixGold();
        $prix = $prix_gold->orderBy('date_mise_a_jour', 'DESC')->first();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'
SELECT *
FROM `prix_gold`
ORDER BY `date_mise_a_jour` DESC
 LIMIT 1

    public function activate()
    {
        $user_id = session()->get('user_id') ?? 1;
        $home = new Home();
        $userModel = new UserModel();
        $prix_gold = new PrixGold();
        $prix = $prix_gold->orderBy('date_mise_a_jour', 'DESC')->first();
        $user = $userModel->find($user_id);
        $solde = $user['solde_monnaie'];
        $prix_gold = $prix['prix'] ?? 30000;
        if ($solde >= $prix_gold) {
            $solde_restant = $solde - $prix_gold;
            $userModel->update($user_id, ['solde_monnaie' => $solde_restant]);
            $userModel->update($user_id, ['is_gold' => true]);
---
SELECT *
FROM `prix_gold`
ORDER BY `date_mise_a_jour` DESC
 LIMIT 1
SELECT *
FROM `users`
WHERE `users`.`id` = '2'
UPDATE `users` SET `solde_monnaie` = 145000
WHERE `users`.`id` IN ('2')
UPDATE `users` SET `is_gold` = 1
WHERE `users`.`id` IN ('2')