app/Controllers/Home.php

    public function profil(){
        $userModel = new UsersModel();
        $userDetailsModel = new UserDetailsModel();
        $user_id = session()->get('user_id');
        $user = $userModel->find($user_id);
        if (!$user) {
            return redirect()->to('/')->with('error', 'Utilisateur introuvable.');
        }

        $session = session();
        $session->set([
            'user_id' => $user['id'],
            'user_role' => $user['role'],
            'user_nom' => $user['nom'],
            'user_prenom' => $user['prenom'],
            'user_email' => $user['email'],
            'user_solde' => $user['solde_monnaie'],
            'user_gold' => $user['is_gold'],
        ]);

        $user_details = $userDetailsModel->where(['user_id' => $user_id])->first();
---
SELECT *
FROM `user_details`
WHERE `user_id` = '2'
 LIMIT 1

    public function freshUser($user_id){
        $userModel = new UsersModel();
        $session = session();

        $freshUser = $userModel->find($user_id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'