app/Controllers/Home.php

SELECT *
FROM `users`
WHERE `email` = 'user1@example.com'
 LIMIT 1
---
    public function login(){
        $email = $this->request->getPost('email');
        $mot_de_passe = $this->request->getPost('mot_de_passe');
        $userModel = new UserModel();
        $user = $userModel->where('email', $email)->first();

SELECT *
FROM `users`
WHERE `users`.`id` = '2'
---
    public function freshUser($user_id){
        $userModel = new UserModel();
        $session = session();

        $freshUser = $userModel->find($user_id);

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `is_gold` = 1
SELECT SUM(`solde_monnaie`) AS `total_solde`
FROM `users`
---
    public function dashboard(){
        $session = session();
        $userId = $session->get('user_id');
        $userRole = $session->get('user_role');

        if ($userRole !== 'admin') {
            if ($userId) {
                return redirect()->to('/profil');
            }

            return redirect()->to('/')->with('error', 'Accès réservé aux administrateurs.');
        }

        $db = db_connect();

        $currentUser = null;
        if ($userId) {
            $currentUser = (new UserModel())->find($userId);
        }

        $totalUsers = (int) $db->table('users')->countAllResults();
        $goldUsers = (int) $db->table('users')->where('is_gold', 1)->countAllResults();

        $walletRow = $db->table('users')
            ->selectSum('solde_monnaie', 'total_solde')
            ->get()
            ->getRowArray();

SELECT `ap`.`user_id`, `ap`.`poids_depart`, `ap`.`poids_objectif`
FROM `achats_programmes` `ap`
SELECT `uo`.`user_id`, `uo`.`objectif_id`
FROM `user_objectifs` `uo`
LEFT JOIN `objectifs` `o` ON `o`.`id` = `uo`.`objectif_id`
ORDER BY `uo`.`date_selection` DESC
---
        ];

        // Récupérer les achats
        $achats = $db->table('achats_programmes ap')
            ->select('ap.user_id, ap.poids_depart, ap.poids_objectif')
            ->get()
            ->getResultArray();

        // Récupérer le dernier objectif choisi pour chaque utilisateur
        $userObjectives = $db->table('user_objectifs uo')
            ->select('uo.user_id, uo.objectif_id')
            ->join('objectifs o', 'o.id = uo.objectif_id', 'left')
            ->orderBy('uo.date_selection', 'DESC')
            ->get()
            ->getResultArray();

SELECT `id`, `libelle`
FROM `objectifs`
---
        }

        // Récupérer les libellés des objectifs
        $objectifs = $db->table('objectifs')
            ->select('id, libelle')
            ->get()
            ->getResultArray();

SELECT `ap`.`regime_id`, `r`.`nom_regime`, COUNT(*) AS total_achats
FROM `achats_programmes` `ap`
LEFT JOIN `regimes` `r` ON `r`.`id` = `ap`.`regime_id`
GROUP BY `ap`.`regime_id`, `r`.`nom_regime`
ORDER BY `total_achats` DESC
 LIMIT 6
---
            ? 'conic-gradient(' . implode(', ', $pieSegments) . ')'
            : 'conic-gradient(#e5e7eb 0% 100%)';

        $popularRegimes = $db->table('achats_programmes ap')
            ->select('ap.regime_id, r.nom_regime, COUNT(*) AS total_achats')
            ->join('regimes r', 'r.id = ap.regime_id', 'left')
            ->groupBy('ap.regime_id, r.nom_regime')
            ->orderBy('total_achats', 'DESC')
            ->limit(6)
            ->get()
            ->getResultArray();

SELECT `t`.`id`, `t`.`user_id`, `t`.`montant`, `t`.`description`, `t`.`date_transaction`, `u`.`nom`, `u`.`prenom`
FROM `porte_monnaie_transactions` `t`
LEFT JOIN `users` `u` ON `u`.`id` = `t`.`user_id`
WHERE `t`.`description` LIKE 'Recharge via code%' ESCAPE '!'
ORDER BY `t`.`date_transaction` DESC
 LIMIT 8
---
        }
        unset($regime);

        $rechargeTransactions = $db->table('porte_monnaie_transactions t')
            ->select('t.id, t.user_id, t.montant, t.description, t.date_transaction, u.nom, u.prenom')
            ->join('users u', 'u.id = t.user_id', 'left')
            ->like('t.description', 'Recharge via code', 'after')
            ->orderBy('t.date_transaction', 'DESC')
            ->limit(8)
            ->get()
            ->getResultArray();