app/Controllers/Objectif.php

    public function index(): string
    {
        $objectifModel = new ObjectifModel();
        $user_id = session()->get('user_id') ? session()->get('user_id') : 1; // Par defaut l'utilisateur 1 (à remplacer par la session réelle)
        $userDetailModel = new UserDetailModel();
        $data['user'] = $userDetailModel->getByUserId($user_id);
        $data['objectifs'] = $objectifModel->findAll();
---
SELECT *
FROM `objectifs`