app/Controllers/RegimeController.php

    public function index()
    {
        $model = new RegimeModel();
        $data['regimes'] = $model->findAll();
---
SELECT *
FROM `regimes`

    public function suggestions(){
        // Récupérer user_id et poids_cible depuis POST ou session
        $user_id = $this->request->getPost('user_id') ?? session()->get('user_id') ?? 1;
        $poids_cible = $this->request->getPost('poids_cible');

        // Si poids_cible n'est pas fourni, le récupérer depuis la dernière entrée de user_objectifs
        if (!$poids_cible) {
            $userObjectifModel = new UserObjectifModel();
            $dernier_objectif = $userObjectifModel->where('user_id', $user_id)
                                                    ->orderBy('date_selection', 'DESC')
                                                    ->first();
---
SELECT *
FROM `user_objectifs`
WHERE `user_id` = '2'
ORDER BY `date_selection` DESC
 LIMIT 1

    private function calculateCouples($user_id, $poids_cible) {
        $regimeModel = new RegimeModel();
        $userDetailModel = new UserDetailModel();
        $sportModel = new SportModel();

        // Récupérer les détails de l'utilisateur
        $userDetails = $userDetailModel->where('user_id', $user_id)->first();
        if (!$userDetails) {
            return [];
        }

        $poids_actuel = (float) $userDetails['poids_actuel'];
        $poids_cible = (float) $poids_cible;
        $diff_poids = $poids_actuel - $poids_cible;

        if ($diff_poids === 0.0) {
            return [];
        }

        $regimes = $regimeModel->findAll();
---
SELECT *
FROM `user_details`
WHERE `user_id` = '2'
 LIMIT 1
SELECT *
FROM `regimes`

    public function monRegime(){
        $regimeModel = new RegimeModel();
        $sportModel = new SportModel();

        $user_id = session()->get('user_id');
        if (!$user_id) {
            return redirect()->to('/login')->with('error', 'Veuillez vous connecter pour accéder à votre régime personnalisé.');
        }

        $achatModel = new AchatModel();
        $derniereAchat = $this->getDerniereAchat($user_id);

        if (!$derniereAchat) {
            return view('regimes/mon_regime', ['monRegime' => null]);
            return redirect()->to('/regimes')->with('success', 'Vous n\'avez pas encore de régime en cours, veuillez voir les suggestions.');
        }

        $regime = $regimeModel->find($derniereAchat['regime_id']);
---
SELECT *
FROM `regimes`
WHERE `regimes`.`id` = '2'