app/Controllers/Transaction.php

    public function findOne($user_id)
    {
        $userModel = new UsersModel();
        $model = new TransactionModel();
        $user = $userModel->find($user_id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'