app/Models/UserDetailModel.php

    public function getByUserId($user_id)
    {
        return $this->where('user_id', $user_id)->first();
---
SELECT *
FROM `user_details`
WHERE `user_id` = '2'
 LIMIT 1